contiki-os/contiki/cpu/cc26xx/dev/cc26xx-rf.c
/*
 * Copyright (c) 2014, Texas Instruments Incorporated - http://www.ti.com/
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*---------------------------------------------------------------------------*/
/**
 * \addtogroup cc26xx-rf
 * @{
 *
 * \file
 * Implementation of the CC26xx RF driver
 */
/*---------------------------------------------------------------------------*/
#include "contiki.h"
#include "dev/radio.h"
#include "dev/cc26xx-rf.h"
#include "dev/oscillators.h"
#include "net/packetbuf.h"
#include "net/rime/rimestats.h"
#include "net/linkaddr.h"
#include "net/netstack.h"
#include "sys/energest.h"
#include "sys/clock.h"
#include "sys/rtimer.h"
#include "lpm.h"
#include "ti-lib.h"
/*---------------------------------------------------------------------------*/
/* RF core and RF HAL API */
#include "hw_rfc_dbell.h"
#include "hw_rfc_pwr.h"
/*---------------------------------------------------------------------------*/
/* RF Core Mailbox API */
#include "mailbox.h"
#include "common_cmd.h"
#include "common_cmd_field.h"
#include "ble_cmd.h"
#include "ble_cmd_field.h"
#include "ieee_cmd.h"
#include "ieee_cmd_field.h"
#include "data_entry.h"
#include "ble_mailbox.h"
#include "ieee_mailbox.h"
/*---------------------------------------------------------------------------*/
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
/*---------------------------------------------------------------------------*/
#define BUSYWAIT_UNTIL(cond, max_time)                                \
  do {                                                                \
    rtimer_clock_t t0;                                                \
    t0 = RTIMER_NOW();                                                \
    while(!(cond) && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (max_time))); \
  } while(0)
/*---------------------------------------------------------------------------*/
#ifndef MIN
#define MIN(n, m)   (((n) < (m)) ? (n) : (m))
#endif
/*---------------------------------------------------------------------------*/
#ifdef __GNUC__
#define CC_ALIGN_ATTR(n) __attribute__ ((aligned(n)))
#else
#define CC_ALIGN_ATTR(n)
#endif
/*---------------------------------------------------------------------------*/
#define DEBUG 0
#if DEBUG
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif
/*---------------------------------------------------------------------------*/
/* Data entry status field constants */
#define DATA_ENTRY_STATUS_PENDING    0x00 /* Not in use by the Radio CPU */
#define DATA_ENTRY_STATUS_ACTIVE     0x01 /* Open for r/w by the radio CPU */
#define DATA_ENTRY_STATUS_BUSY       0x02 /* Ongoing r/w */
#define DATA_ENTRY_STATUS_FINISHED   0x03 /* Free to use and to free */
#define DATA_ENTRY_STATUS_UNFINISHED 0x04 /* Partial RX entry */
/*---------------------------------------------------------------------------*/
/* RF stats data structure */
static uint8_t rf_stats[16] = { 0 };
/*---------------------------------------------------------------------------*/
/* RF Command status constants - Correspond to values in the CMDSTA register */
#define RF_CMD_STATUS_PENDING         0x00
#define RF_CMD_STATUS_DONE            0x01
#define RF_CMD_STATUS_ILLEGAL_PTR     0x81
#define RF_CMD_STATUS_UNKNOWN_CMD     0x82
#define RF_CMD_STATUS_UNKNOWN_DIR_CMD 0x83
#define RF_CMD_STATUS_CONTEXT_ERR     0x85
#define RF_CMD_STATUS_SCHEDULING_ERR  0x86
#define RF_CMD_STATUS_PAR_ERR         0x87
#define RF_CMD_STATUS_QUEUE_ERR       0x88
#define RF_CMD_STATUS_QUEUE_BUSY      0x89

/* Status values starting with 0x8 correspond to errors */
#define RF_CMD_STATUS_ERR_MASK        0x80

/* Return values for rf_send_cmd_ok */
#define RF_CMD_ERROR                     0
#define RF_CMD_OK                        1

/* The size of the RF commands buffer */
#define RF_CMD_BUFFER_SIZE             128
/*---------------------------------------------------------------------------*/
/* RF Radio Op status constants. Field 'status' in Radio Op command struct */
#define RF_RADIO_OP_STATUS_IDLE             0x0000
#define RF_RADIO_OP_STATUS_PENDING          0x0001
#define RF_RADIO_OP_STATUS_ACTIVE           0x0002
#define RF_RADIO_OP_STATUS_SKIPPED          0x0003
#define RF_RADIO_OP_STATUS_DONE_OK          0x0400
#define RF_RADIO_OP_STATUS_DONE_COUNTDOWN   0x0401
#define RF_RADIO_OP_STATUS_DONE_RXERR       0x0402
#define RF_RADIO_OP_STATUS_DONE_TIMEOUT     0x0403
#define RF_RADIO_OP_STATUS_DONE_STOPPED     0x0404
#define RF_RADIO_OP_STATUS_DONE_ABORT       0x0405
#define RF_RADIO_OP_STATUS_ERROR_PAST_START 0x0800
#define RF_RADIO_OP_STATUS_ERROR_START_TRIG 0x0801
#define RF_RADIO_OP_STATUS_ERROR_CONDITION  0x0802
#define RF_RADIO_OP_STATUS_ERROR_PAR        0x0803
#define RF_RADIO_OP_STATUS_ERROR_POINTER    0x0804
#define RF_RADIO_OP_STATUS_ERROR_CMDID      0x0805
#define RF_RADIO_OP_STATUS_ERROR_NO_SETUP   0x0807
#define RF_RADIO_OP_STATUS_ERROR_NO_FS      0x0808
#define RF_RADIO_OP_STATUS_ERROR_SYNTH_PROG 0x0809

/* Additional Op status values for IEEE mode */
#define RF_RADIO_OP_STATUS_IEEE_SUSPENDED           0x2001
#define RF_RADIO_OP_STATUS_IEEE_DONE_OK             0x2400
#define RF_RADIO_OP_STATUS_IEEE_DONE_BUSY           0x2401
#define RF_RADIO_OP_STATUS_IEEE_DONE_STOPPED        0x2402
#define RF_RADIO_OP_STATUS_IEEE_DONE_ACK            0x2403
#define RF_RADIO_OP_STATUS_IEEE_DONE_ACKPEND        0x2404
#define RF_RADIO_OP_STATUS_IEEE_DONE_TIMEOUT        0x2405
#define RF_RADIO_OP_STATUS_IEEE_DONE_BGEND          0x2406
#define RF_RADIO_OP_STATUS_IEEE_DONE_ABORT          0x2407
#define RF_RADIO_OP_STATUS_ERROR_WRONG_BG           0x0806
#define RF_RADIO_OP_STATUS_IEEE_ERROR_PAR           0x2800
#define RF_RADIO_OP_STATUS_IEEE_ERROR_NO_SETUP      0x2801
#define RF_RADIO_OP_STATUS_IEEE_ERROR_NO_FS         0x2802
#define RF_RADIO_OP_STATUS_IEEE_ERROR_SYNTH_PROG    0x2803
#define RF_RADIO_OP_STATUS_IEEE_ERROR_RXOVF         0x2804
#define RF_RADIO_OP_STATUS_IEEE_ERROR_TXUNF         0x2805

/* Op status values for BLE mode */
#define RF_RADIO_OP_STATUS_BLE_DONE_OK              0x1400
#define RF_RADIO_OP_STATUS_BLE_DONE_RXTIMEOUT       0x1401
#define RF_RADIO_OP_STATUS_BLE_DONE_NOSYNC          0x1402
#define RF_RADIO_OP_STATUS_BLE_DONE_RXERR           0x1403
#define RF_RADIO_OP_STATUS_BLE_DONE_CONNECT         0x1404
#define RF_RADIO_OP_STATUS_BLE_DONE_MAXNACK         0x1405
#define RF_RADIO_OP_STATUS_BLE_DONE_ENDED           0x1406
#define RF_RADIO_OP_STATUS_BLE_DONE_ABORT           0x1407
#define RF_RADIO_OP_STATUS_BLE_DONE_STOPPED         0x1408
#define RF_RADIO_OP_STATUS_BLE_ERROR_PAR            0x1800
#define RF_RADIO_OP_STATUS_BLE_ERROR_RXBUF          0x1801
#define RF_RADIO_OP_STATUS_BLE_ERROR_NO_SETUP       0x1802
#define RF_RADIO_OP_STATUS_BLE_ERROR_NO_FS          0x1803
#define RF_RADIO_OP_STATUS_BLE_ERROR_SYNTH_PROG     0x1804
#define RF_RADIO_OP_STATUS_BLE_ERROR_RXOVF          0x1805
#define RF_RADIO_OP_STATUS_BLE_ERROR_TXUNF          0x1806

/* Bits 15:12 signify the protocol */
#define RF_RADIO_OP_STATUS_PROTO_MASK               0xF000
#define RF_RADIO_OP_STATUS_PROTO_GENERIC            0x0000
#define RF_RADIO_OP_STATUS_PROTO_BLE                0x1000
#define RF_RADIO_OP_STATUS_PROTO_IEEE               0x2000
#define RF_RADIO_OP_STATUS_PROTO_PROP               0x3000

/* Bits 11:10 signify Running / Done OK / Done with error */
#define RF_RADIO_OP_MASKED_STATUS           0x0C00
#define RF_RADIO_OP_MASKED_STATUS_RUNNING   0x0000
#define RF_RADIO_OP_MASKED_STATUS_DONE      0x0400
#define RF_RADIO_OP_MASKED_STATUS_ERROR     0x0800
/*---------------------------------------------------------------------------*/
/**
 * \brief Returns the current status of a running Radio Op command
 * \param a A pointer with the buffer used to initiate the command
 * \return The value of the Radio Op buffer's status field
 *
 * This macro can be used to e.g. return the status of a previously
 * initiated background operation, or of an immediate command
 */
#define RF_RADIO_OP_GET_STATUS(a) GET_FIELD_V(a, radioOp, status)
/*---------------------------------------------------------------------------*/
/* Special value returned by CMD_IEEE_CCA_REQ when an RSSI is not available */
#define RF_CMD_CCA_REQ_RSSI_UNKNOWN     -128

/* Used for the return value of channel_clear */
#define RF_CCA_CLEAR                       1
#define RF_CCA_BUSY                        0

/* Used as an error return value for get_cca_info */
#define RF_GET_CCA_INFO_ERROR           0xFF

