contiki-os/contiki/cpu/cc26xx/dev/cc26xx-rf.c
  /* Current RSSI in bits 23:16 of cmd_status */
  rssi = (cmd_status >> 16) & 0xFF;

  /* If we were off, turn back off */
  if(was_off) {
    off();
  }

  return rssi;
}
/*---------------------------------------------------------------------------*/
/* Returns the current TX power in dBm */
static radio_value_t
get_tx_power(void)
{
  return tx_power_current->dbm;
}
/*---------------------------------------------------------------------------*/
/*
 * Set TX power to 'at least' power dBm
 * This works with a lookup table. If the value of 'power' does not exist in
 * the lookup table, TXPOWER will be set to the immediately higher available
 * value
 */
static void
set_tx_power(radio_value_t power)
{
  uint32_t cmd_status;
  int i;

  /* Send a CMD_SET_TX_POWER command to the RF */
  memset(cmd_immediate_buf, 0x00, SIZEOF_STRUCT(CMD_SET_TX_POWER));

  GET_FIELD(cmd_immediate_buf, command, commandNo) = CMD_SET_TX_POWER;

  for(i = OUTPUT_CONFIG_COUNT - 1; i >= 0; --i) {
    if(power <= output_power[i].dbm) {
      GET_FIELD(cmd_immediate_buf, CMD_SET_TX_POWER, txPower) =
        BITVALUE(CMD_SET_TX_POWER, txPower, IB, output_power[i].register_ib) |
        BITVALUE(CMD_SET_TX_POWER, txPower, GC, output_power[i].register_gc) |
        BITVALUE(CMD_SET_TX_POWER, txPower, tempCoeff, 0);

      if(rf_send_cmd((uint32_t)cmd_immediate_buf, &cmd_status) == RF_CMD_OK) {
        /* Success: Remember the new setting */
        tx_power_current = &output_power[i];
      } else {
        PRINTF("set_tx_power: CMDSTA=0x%08lx\n", cmd_status);
      }
      return;
    }
  }
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Wait till running radio Op command completes
 *
 * \return RF_CMD_ERROR or RF_CMD_OK
 *
 * RF_CMD_OK will be returned if the Radio Op returned with
 * RF_RADIO_OP_STATUS_DONE_OK
 *
 * RF_CMD_ERROR will be returned in the radio op returned with any other
 * RF_RADIO_OP_STATUS_DONE_xyz
 */
static uint_fast8_t
rf_wait_cmd_completed_ok(uint8_t *cmd)
{
  _TYPE_radioOp_status tmp_status;
  uint32_t timeoutCount = 0;

  /*
   * 0x04XX=DONE, 0x0400=DONE_OK while all other "DONE" values means done
   * but with some kind of error (ref. "Common radio operation status codes")
   */
  do {
    tmp_status = GET_FIELD_V(cmd, radioOp, status);
    if(++timeoutCount > 500000) {
      return RF_CMD_ERROR;
    }
  } while((tmp_status & RF_RADIO_OP_MASKED_STATUS) != RF_RADIO_OP_MASKED_STATUS_DONE);

  return tmp_status == RF_RADIO_OP_STATUS_DONE_OK;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief    Builds common radio parameters for radio operations
 *
 * \param    *cmd     Pointer to buffer to add parameters to
 * \param    command   Radio command number (e.g. COMMAND_RADIO_SETUP)
 *
 * \note     The buffer must be emptied with memset() before calling this function
 *
 * \return   None
 */
static void
rf_build_radio_op_cmd(uint8_t *cmd, uint16_t command)
{
  GET_FIELD(cmd, radioOp, commandNo) = command;
  GET_FIELD(cmd, radioOp, status) = IDLE;
  GET_FIELD(cmd, radioOp, pNextOp) = NULL;
  GET_FIELD(cmd, radioOp, startTime) = 0;
  GET_FIELD(cmd, radioOp, startTrigger) = TRIG_NOW;
  GET_FIELD(cmd, radioOp, condition) = COND_NEVER;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Sends a CMD_RADIO_SETUP for the selected mode (IEEE or BLE)
 * \param mode RF_MODE_BLE or RF_MODE_IEEE
 * \return RF_CMD_OK or RF_CMD_ERROR
 *
 * ToDo: Likely to need one more argument to set bNoAdi<foo> on first startup
 * vs when coming back from sleep
 */
static uint8_t
rf_radio_setup(uint8_t mode)
{
  uint32_t cmd_status;

  /* Create radio setup command */
  memset(cmd_immediate_buf, 0x00, SIZEOF_RADIO_OP(CMD_RADIO_SETUP));
  rf_build_radio_op_cmd(cmd_immediate_buf, CMD_RADIO_SETUP);

  /* Set output power to the current (or default) value */
  GET_FIELD(cmd_immediate_buf, CMD_RADIO_SETUP, txPower) =
    BITVALUE(CMD_RADIO_SETUP, txPower, IB, tx_power_current->register_ib) |
    BITVALUE(CMD_RADIO_SETUP, txPower, GC, tx_power_current->register_gc) |
    BITVALUE(CMD_RADIO_SETUP, txPower, tempCoeff, 0);

  /* Do mode-dependent things (e.g. apply overrides) */
  if(mode == RF_MODE_IEEE) {
    /* Add override control pointer */
    GET_FIELD(cmd_immediate_buf, CMD_RADIO_SETUP, pRegOverride) = ieee_overrides;
#if CC26XX_RF_BLE_SUPPORT
  } else if(mode == RF_MODE_BLE) {
    /* Add override control pointer */
    GET_FIELD(cmd_immediate_buf, CMD_RADIO_SETUP, pRegOverride) = ble_overrides;
#endif
  } else {
    PRINTF("rf_radio_setup: Unknown mode %u\n", mode);
    return RF_CMD_ERROR;
  }

  /* Lastly, set the mode */
  GET_FIELD(cmd_immediate_buf, CMD_RADIO_SETUP, mode) = mode;

  /* Send Radio setup to RF Core */
  if(rf_send_cmd((uint32_t)cmd_immediate_buf, &cmd_status) != RF_CMD_OK) {
    PRINTF("rf_radio_setup: CMD_RADIO_SETUP, CMDSTA=0x%08lx, status=0x%04x\n",
           cmd_status, RF_RADIO_OP_GET_STATUS(cmd_immediate_buf));
    return RF_CMD_ERROR;
  }

  /* Wait until radio setup is done */
  if(rf_wait_cmd_completed_ok(cmd_immediate_buf) != RF_CMD_OK) {
    PRINTF("rf_radio_setup: CMD_RADIO_SETUP wait, CMDSTA=0x%08lx, status=0x%04x\n",
           cmd_status, RF_RADIO_OP_GET_STATUS(cmd_immediate_buf));
    return RF_CMD_ERROR;
  }

  return RF_CMD_OK;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Applies patches (if any)
 * \return RF_CMD_OK or RF_CMD_ERROR
 *
 * Currently patches are not required.
 */
static uint8_t
apply_patches()
{
  uint32_t cmd_status;

  /* Patch of uninitialized pointer */
  *((uint32_t *)0x21000028) = 0x00000000;

  /* Start radio timer (RAT) */
  if(rf_send_cmd(CMDR_DIR_CMD(CMD_START_RAT), &cmd_status) != RF_CMD_OK) {
    PRINTF("apply_patches: START_RAT fail, CMDSTA=0x%08lx\n", cmd_status);
    return RF_CMD_ERROR;
  }

  return RF_CMD_OK;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief    Set up radio in IEEE802.15.4 RX mode
 *
 * \return   RF_CMD_OK   Succeeded
 * \return   RF_CMD_ERROR   Failed
 *
 * This function assumes that cmd_ieee_rx_buf has been previously populated
 * with correct values. This can be done through init_rf_params (sets defaults)
 * or through Contiki's extended RF API (set_value, set_object)
 */
static uint8_t
rf_cmd_ieee_rx()
{
  uint32_t cmd_status;
  rtimer_clock_t t0;
  int ret;

  ret = rf_send_cmd((uint32_t)cmd_ieee_rx_buf, &cmd_status);

  if(ret != RF_CMD_OK) {
    PRINTF("rf_cmd_ieee_rx: ret=%d, CMDSTA=0x%08lx, status=0x%04x\n",
           ret, cmd_status, RF_RADIO_OP_GET_STATUS(cmd_ieee_rx_buf));
  }

  t0 = RTIMER_NOW();

  while(RF_RADIO_OP_GET_STATUS(cmd_ieee_rx_buf) != RF_RADIO_OP_STATUS_ACTIVE &&
        (RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + ENTER_RX_WAIT_TIMEOUT)));

  /* Wait to enter RX */
  if(RF_RADIO_OP_GET_STATUS(cmd_ieee_rx_buf) != RF_RADIO_OP_STATUS_ACTIVE) {
    PRINTF("rf_cmd_ieee_rx: CMDSTA=0x%08lx, status=0x%04x\n",
           cmd_status, RF_RADIO_OP_GET_STATUS(cmd_ieee_rx_buf));
    return RF_CMD_ERROR;
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static void
init_rx_buffers(void)
{
  /* Two-element circular buffer, hardcoded for now.. */
  GET_FIELD(rx_buf_0, dataEntry, pNextEntry) = rx_buf_1;
  GET_FIELD(rx_buf_0, dataEntry, config) = 0x04;
  GET_FIELD(rx_buf_0, dataEntry, length) = sizeof(rx_buf_0) - 8;

