contiki-os/contiki/cpu/cc26xx/dev/cc26xx-rf.c
  GET_FIELD(rx_buf_1, dataEntry, pNextEntry) = rx_buf_2;
  GET_FIELD(rx_buf_1, dataEntry, config) = 0x04;
  GET_FIELD(rx_buf_1, dataEntry, length) = sizeof(rx_buf_1) - 8;

  GET_FIELD(rx_buf_2, dataEntry, pNextEntry) = rx_buf_3;
  GET_FIELD(rx_buf_2, dataEntry, config) = 0x04;
  GET_FIELD(rx_buf_2, dataEntry, length) = sizeof(rx_buf_2) - 8;

  /* Point to first element again */
  GET_FIELD(rx_buf_3, dataEntry, pNextEntry) = rx_buf_0;
  GET_FIELD(rx_buf_3, dataEntry, config) = 0x04;
  GET_FIELD(rx_buf_3, dataEntry, length) = sizeof(rx_buf_3) - 8;
}
/*---------------------------------------------------------------------------*/
static void
init_rf_params(void)
{
  memset(cmd_ieee_rx_buf, 0x00, SIZEOF_RADIO_OP(CMD_IEEE_RX));

  GET_FIELD(cmd_ieee_rx_buf, radioOp, commandNo) = CMD_IEEE_RX;
  GET_FIELD(cmd_ieee_rx_buf, radioOp, status) = IDLE;
  GET_FIELD(cmd_ieee_rx_buf, radioOp, pNextOp) = NULL;
  GET_FIELD(cmd_ieee_rx_buf, radioOp, startTime) = 0x00000000;
  GET_FIELD(cmd_ieee_rx_buf, radioOp, startTrigger) = TRIG_NOW;
  GET_FIELD(cmd_ieee_rx_buf, radioOp, condition) = COND_NEVER;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, channel) = CC26XX_RF_CHANNEL;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, rxConfig) =
    BITVALUE(CMD_IEEE_RX, rxConfig, bAutoFlushCrc, 0) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bAutoFlushIgn, 0) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bIncludePhyHdr, 0) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bIncludeCrc, 1) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bAppendRssi, 1) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bAppendCorrCrc, 1) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bAppendSrcInd, 0) |
    BITVALUE(CMD_IEEE_RX, rxConfig, bAppendTimestamp, 0);
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, pRxQ) = &rx_data_queue;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, pOutput) = rf_stats;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, frameFiltOpt) =
#if CC26XX_RF_CONF_PROMISCOUS
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, frameFiltEn, 0) |
#else
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, frameFiltEn, 1) |
#endif
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, frameFiltStop, 1) |
#if CC26XX_RF_CONF_AUTOACK
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, autoAckEn, 1) |
#else
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, autoAckEn, 0) |
#endif
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, slottedAckEn, 0) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, autoPendEn, 0) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, defaultPend, 0) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, bPendDataReqOnly, 0) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, bPanCoord, 0) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, maxFrameVersion, 1) |
    BITVALUE(CMD_IEEE_RX, frameFiltOpt, bStrictLenFilter, 0);
  /* Receive all frame types */
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, frameTypes) =
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt0Beacon, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt1Data, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt2Ack, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt3MacCmd, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt4Reserved, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt5Reserved, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt6Reserved, 1) |
    BITVALUE(CMD_IEEE_RX, frameTypes, bAcceptFt7Reserved, 1);
  /* Configure CCA settings */
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, ccaOpt) =
    BITVALUE(CMD_IEEE_RX, ccaOpt, ccaEnEnergy, 1) |
    BITVALUE(CMD_IEEE_RX, ccaOpt, ccaEnCorr, 0) |
    BITVALUE(CMD_IEEE_RX, ccaOpt, ccaEnSync, 0) |
    BITVALUE(CMD_IEEE_RX, ccaOpt, ccaCorrOp, 0) |
    BITVALUE(CMD_IEEE_RX, ccaOpt, ccaSyncOp, 0);
  /* Set CCA RSSI Threshold, 0xA6 corresponds to -90dBm (two's comp.)*/
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, ccaRssiThr) = 0xA6;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, numExtEntries) = 0x00;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, numShortEntries) = 0x00;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, pExtEntryList) = 0;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, pShortEntryList) = 0;

  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, endTrigger) = TRIG_NEVER;
  GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, endTime) = 0x00000000;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Turn on power to the RFC and boot it.
 *
 * \return RF_CMD_OK or RF_CMD_ERROR
 */
static int
power_up(void)
{
  uint32_t cmd_status;
  bool interrupts_disabled = ti_lib_int_master_disable();

  ti_lib_int_pend_clear(INT_RF_CPE0);
  ti_lib_int_pend_clear(INT_RF_CPE1);
  ti_lib_int_disable(INT_RF_CPE0);
  ti_lib_int_disable(INT_RF_CPE1);

  /* Enable RF Core power domain */
  ti_lib_prcm_power_domain_on(PRCM_DOMAIN_RFCORE);
  while(ti_lib_prcm_power_domain_status(PRCM_DOMAIN_RFCORE)
        != PRCM_DOMAIN_POWER_ON);

  ti_lib_prcm_domain_enable(PRCM_DOMAIN_RFCORE);
  ti_lib_prcm_load_set();
  while(!ti_lib_prcm_load_get());

  while(!rf_is_accessible()) {
    PRINTF("power_up: Not ready\n");
  }

  HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = 0x0;
  HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) = 0x0;
  ti_lib_int_enable(INT_RF_CPE0);
  ti_lib_int_enable(INT_RF_CPE1);

  if(!interrupts_disabled) {
    ti_lib_int_master_enable();
  }

  /* Let CPE boot */
  HWREG(RFC_PWR_NONBUF_BASE + RFC_PWR_O_PWMCLKEN) = RF_CORE_CLOCKS_MASK;

  /* Send ping (to verify RFCore is ready and alive) */
  if(rf_send_cmd(CMDR_DIR_CMD(CMD_PING), &cmd_status) != RF_CMD_OK) {
    PRINTF("power_up: CMD_PING fail, CMDSTA=0x%08lx\n", cmd_status);
    return RF_CMD_ERROR;
  }

  return RF_CMD_OK;
}
/*---------------------------------------------------------------------------*/
/**
 * \brief Disable RFCORE clock domain in the MCU VD and turn off the RFCORE PD
 */
static void
power_down(void)
{
  bool interrupts_disabled = ti_lib_int_master_disable();
  ti_lib_int_disable(INT_RF_CPE0);
  ti_lib_int_disable(INT_RF_CPE1);

  if(rf_is_accessible()) {
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIFG) = 0x0;
    HWREG(RFC_DBELL_NONBUF_BASE + RFC_DBELL_O_RFCPEIEN) = 0x0;
  }

  /* Shut down the RFCORE clock domain in the MCU VD */
  ti_lib_prcm_domain_disable(PRCM_DOMAIN_RFCORE);
  ti_lib_prcm_load_set();
  while(!ti_lib_prcm_load_get());

  /* Turn off RFCORE PD */
  ti_lib_prcm_power_domain_off(PRCM_DOMAIN_RFCORE);
  while(ti_lib_prcm_power_domain_status(PRCM_DOMAIN_RFCORE)
        != PRCM_DOMAIN_POWER_OFF);

  ti_lib_int_pend_clear(INT_RF_CPE0);
  ti_lib_int_pend_clear(INT_RF_CPE1);
  ti_lib_int_enable(INT_RF_CPE0);
  ti_lib_int_enable(INT_RF_CPE1);
  if(!interrupts_disabled) {
    ti_lib_int_master_enable();
  }
}
/*---------------------------------------------------------------------------*/
static int
rx_on(void)
{
  int ret;

  /* Get status of running IEEE_RX (if any) */
  if(rf_is_on()) {
    PRINTF("rx_on: We were on. PD=%u, RX=0x%04x \n", rf_is_accessible(),
           RF_RADIO_OP_GET_STATUS(cmd_ieee_rx_buf));
    return RF_CMD_OK;
  }

  /* Put CPE in RX using the currently configured parameters */
  ret = rf_cmd_ieee_rx();

  if(ret) {
    ENERGEST_ON(ENERGEST_TYPE_LISTEN);
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
rx_off(void)
{
  uint32_t cmd_status;
  int ret;

