contiki-os/contiki/cpu/cc26xx/dev/cc26xx-rf.c
    set_tx_power(value);

    return RADIO_RESULT_OK;
  case RADIO_PARAM_CCA_THRESHOLD:
    GET_FIELD(cmd_ieee_rx_buf, CMD_IEEE_RX, ccaRssiThr) = (int8_t)value;
    break;
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }

  /* If we reach here we had no errors. Apply new settings */
  if(!rf_is_on()) {
    was_off = 1;
    if(on() != RF_CMD_OK) {
      PRINTF("set_value: on() failed (2)\n");
      return RADIO_RESULT_ERROR;
    }
  }

  if(rx_off() != RF_CMD_OK) {
    PRINTF("set_value: rx_off() failed\n");
    rv = RADIO_RESULT_ERROR;
  }

  if(rx_on() != RF_CMD_OK) {
    PRINTF("set_value: rx_on() failed\n");
    rv = RADIO_RESULT_ERROR;
  }

  /* If we were off, turn back off */
  if(was_off) {
    off();
  }

  return rv;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_object(radio_param_t param, void *dest, size_t size)
{
  uint8_t *target;
  uint8_t *src;
  int i;

  if(param == RADIO_PARAM_64BIT_ADDR) {
    if(size != 8 || !dest) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    target = dest;
    src = (uint8_t *)(GET_FIELD_PTR(cmd_ieee_rx_buf, CMD_IEEE_RX, localExtAddr));

    for(i = 0; i < 8; i++) {
      target[i] = src[7 - i];
    }

    return RADIO_RESULT_OK;
  }
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_object(radio_param_t param, const void *src, size_t size)
{
  uint8_t was_off = 0;
  radio_result_t rv;
  int i;
  uint8_t *dst;

  if(param == RADIO_PARAM_64BIT_ADDR) {
    if(size != 8 || !src) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    dst = (uint8_t *)(GET_FIELD_PTR(cmd_ieee_rx_buf, CMD_IEEE_RX,
                                    localExtAddr));

    for(i = 0; i < 8; i++) {
      dst[i] = ((uint8_t *)src)[7 - i];
    }

    if(!rf_is_on()) {
      was_off = 1;
      if(on() != RF_CMD_OK) {
        PRINTF("set_object: on() failed\n");
        return RADIO_RESULT_ERROR;
      }
    }

    if(rx_off() != RF_CMD_OK) {
      PRINTF("set_object: rx_off() failed\n");
      rv = RADIO_RESULT_ERROR;
    }

    if(rx_on() != RF_CMD_OK) {
      PRINTF("set_object: rx_on() failed\n");
      rv = RADIO_RESULT_ERROR;
    }

    /* If we were off, turn back off */
    if(was_off) {
      off();
    }

    return rv;
  }
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
const struct radio_driver cc26xx_rf_driver = {
  init,
  prepare,
  transmit,
  send,
  read_frame,
  channel_clear,
  receiving_packet,
  pending_packet,
  on,
  off,
  get_value,
  set_value,
  get_object,
  set_object,
};
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(cc26xx_rf_process, ev, data)
{
  int len;

  PROCESS_BEGIN();

  while(1) {
    PROCESS_WAIT_EVENT();
    do {
      packetbuf_clear();
      len = read_frame(packetbuf_dataptr(), PACKETBUF_SIZE);

      if(len > 0) {
        packetbuf_set_datalen(len);

        NETSTACK_RDC.input();
      }
    } while(len > 0);
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
#if CC26XX_RF_BLE_SUPPORT
/*---------------------------------------------------------------------------*/
/**
 * \brief    Builds common radio parameters for radio operations
 *
 * \param    *cmd     Pointer to buffer to add parameters to
 * \param    command   Radio command number (e.g. COMMAND_RADIO_SETUP)
 *
 * \note     The buffer must be emptied with memset() before calling this function
 *
 * \return   None
 */
static void
rf_build_ble_radio_op_cmd(uint8_t *cmd, uint16_t command)
{
  GET_FIELD(cmd, radioOp, commandNo) = command;
  GET_FIELD(cmd, radioOp, status) = IDLE;
  GET_FIELD(cmd, radioOp, pNextOp) = NULL;
  GET_FIELD(cmd, radioOp, startTime) = 0;
  GET_FIELD(cmd, radioOp, startTrigger) = TRIG_NOW;
  GET_FIELD(cmd, radioOp, condition) = COND_NEVER;
}
/*---------------------------------------------------------------------------*/
static void
init_ble()
{
  ble_mode_on = 0;

  memset(beacond_config.adv_name, 0, BLE_ADV_NAME_BUF_LEN);
  beacond_config.interval = BLE_ADV_INTERVAL;
}
/*---------------------------------------------------------------------------*/
static int
send_ble_adv_nc(int channel, uint8_t *output, uint8_t *adv_payload,
                int adv_payload_len, uint16_t *dev_address)
{
  uint32_t cmd_status;
  int ret;

  /* Erase ble_tx_rx_buf array */
  memset(ble_tx_rx_buf, 0x00, SIZEOF_RADIO_OP(CMD_BLE_ADV_NC));
  rf_build_ble_radio_op_cmd(ble_tx_rx_buf, CMD_BLE_ADV_NC);

  GET_FIELD(ble_tx_rx_buf, bleRadioOp, channel) = channel;
  GET_FIELD(ble_tx_rx_buf, bleRadioOp, whitening) = 0;

  memset(ble_cmd_buf, 0x00, SIZEOF_STRUCT(bleAdvPar));
  GET_FIELD(ble_tx_rx_buf, bleRadioOp, pParams) = (uint8_t *)ble_cmd_buf;
  GET_FIELD(ble_tx_rx_buf, bleRadioOp, pOutput) = output;

  /* Set up BLE Advertisement parameters */
  GET_FIELD(ble_cmd_buf, bleAdvPar, pRxQ) = NULL;
  GET_FIELD(ble_cmd_buf, bleAdvPar, rxConfig) = 0;
  GET_FIELD(ble_cmd_buf, bleAdvPar, advConfig) = 0;
  GET_FIELD(ble_cmd_buf, bleAdvPar, advLen) = adv_payload_len;
  GET_FIELD(ble_cmd_buf, bleAdvPar, scanRspLen) = 0;
  GET_FIELD(ble_cmd_buf, bleAdvPar, pAdvData) = adv_payload;
  GET_FIELD(ble_cmd_buf, bleAdvPar, pScanRspData) = NULL;
  GET_FIELD(ble_cmd_buf, bleAdvPar, pDeviceAddress) = dev_address;
  GET_FIELD(ble_cmd_buf, bleAdvPar, pWhiteList) = NULL;
  GET_FIELD(ble_cmd_buf, bleAdvPar, endTrigger) = TRIG_NEVER;
  GET_FIELD(ble_cmd_buf, bleAdvPar, endTime) = TRIG_NEVER;

  if(rf_send_cmd((uint32_t)ble_tx_rx_buf, &cmd_status) == RF_CMD_ERROR) {
    PRINTF("send_ble_adv_nc: Chan=%d CMDSTA=0x%08lx, status=0x%04x\n",
           channel, cmd_status, RF_RADIO_OP_GET_STATUS(ble_tx_rx_buf));
    return RF_CMD_ERROR;
  }

  /* Wait for the ADV_NC to go out */
  while((RF_RADIO_OP_GET_STATUS(ble_tx_rx_buf) & RF_RADIO_OP_MASKED_STATUS)
        == RF_RADIO_OP_MASKED_STATUS_RUNNING);

