contiki-os/contiki/cpu/cc26xx/dev/cc26xx-rf.c
  if(RF_RADIO_OP_GET_STATUS(ble_tx_rx_buf) == RF_RADIO_OP_STATUS_BLE_DONE_OK) {
    /* Sent OK */
    ret = RF_CMD_OK;
  } else {
    /* Radio Op completed, but ADV NC was not sent */
    PRINTF("send_ble_adv_nc: Chan=%d CMDSTA=0x%08lx, status=0x%04x\n",
           channel, cmd_status, RF_RADIO_OP_GET_STATUS(ble_tx_rx_buf));
    ret = RF_CMD_ERROR;
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
send_ble_adv(int channel, uint8_t *adv_payload, int adv_payload_len)
{
  if(send_ble_adv_nc(channel, rf_stats, adv_payload, adv_payload_len,
                     (uint16_t *)&linkaddr_node_addr.u8[2]) != RF_CMD_OK) {
    PRINTF("send_ble_adv: Channel=%d, Error advertising\n", channel);
    /* Break the loop, but don't return just yet */
    return RF_CMD_ERROR;
  }

  return RF_CMD_OK;
}
/*---------------------------------------------------------------------------*/
PROCESS_THREAD(cc26xx_rf_ble_beacon_process, ev, data)
{
  static struct etimer ble_adv_et;
  static uint8_t payload[BLE_ADV_PAYLOAD_BUF_LEN];
  static int p = 0;
  static int i;
  uint8_t was_on;
  int j;
  uint32_t cmd_status;
  bool interrupts_disabled;

  PROCESS_BEGIN();

  while(1) {
    etimer_set(&ble_adv_et, beacond_config.interval);

    PROCESS_WAIT_EVENT();

    if(ev == PROCESS_EVENT_EXIT) {
      PROCESS_EXIT();
    }

    /* Set the adv payload each pass: The device name may have changed */
    p = 0;

    /* device info */
    payload[p++] = 0x02;          /* 2 bytes */
    payload[p++] = BLE_ADV_TYPE_DEVINFO;
    payload[p++] = 0x1a;          /* LE general discoverable + BR/EDR */
    payload[p++] = 1 + strlen(beacond_config.adv_name);
    payload[p++] = BLE_ADV_TYPE_NAME;
    memcpy(&payload[p], beacond_config.adv_name,
           strlen(beacond_config.adv_name));
    p += strlen(beacond_config.adv_name);

    for(i = 0; i < BLE_ADV_MESSAGES; i++) {
      /*
       * Under ContikiMAC, some IEEE-related operations will be called from an
       * interrupt context. We need those to see that we are in BLE mode.
       */
      interrupts_disabled = ti_lib_int_master_disable();
      ble_mode_on = 1;
      if(!interrupts_disabled) {
        ti_lib_int_master_enable();
      }

      /*
       * Send BLE_ADV_MESSAGES beacon bursts. Each burst on all three
       * channels, with a BLE_ADV_DUTY_CYCLE interval between bursts
       *
       * First, determine our state:
       *
       * If we are running NullRDC, we are likely in IEEE RX mode. We need to
       * abort the IEEE BG Op before entering BLE mode.
       * If we are ContikiMAC, we are likely off, in which case we need to
       * boot the CPE before entering BLE mode
       */
      was_on = rf_is_accessible();

      if(was_on) {
        /*
         * We were on: If we are in the process of receiving an IEEE frame,
         * abort the BLE beacon burst. Otherwise, terminate the IEEE BG Op
         * so we can switch to BLE mode
         */
        if(receiving_packet()) {
          PRINTF("cc26xx_rf_ble_beacon_process: We were receiving\n");

          /* Abort this pass */
          break;
        }

        if(rx_off() != RF_CMD_OK) {
          PRINTF("cc26xx_rf_ble_beacon_process: rx_off() failed\n");

          /* Abort this pass */
          break;
        }
      } else {
        /* Request the HF XOSC to source the HF clock. */
        oscillators_request_hf_xosc();

        /* We were off: Boot the CPE */
        if(power_up() != RF_CMD_OK) {
          PRINTF("cc26xx_rf_ble_beacon_process: power_up() failed\n");

          /* Abort this pass */
          break;
        }

        if(apply_patches() != RF_CMD_OK) {
          PRINTF("cc26xx_rf_ble_beacon_process: apply_patches() failed\n");

          /* Abort this pass */
          break;
        }

        /* Trigger a switch to the XOSC, so that we can use the FS */
        oscillators_switch_to_hf_xosc();
      }

      /* Enter BLE mode */
      if(rf_radio_setup(RF_MODE_BLE) != RF_CMD_OK) {
        PRINTF("cc26xx_rf_ble_beacon_process: Error entering BLE mode\n");
        /* Continue so we can at least try to restore our previous state */
      } else {
        /* Send advertising packets on all 3 advertising channels */
        for(j = 37; j <= 39; j++) {
          if(send_ble_adv(j, payload, p) != RF_CMD_OK) {
            PRINTF("cc26xx_rf_ble_beacon_process: Channel=%d,"
                   "Error advertising\n", j);
            /* Break the loop, but don't return just yet */
            break;
          }
        }
      }

      /* Send a CMD_STOP command to RF Core */
      if(rf_send_cmd(CMDR_DIR_CMD(CMD_STOP), &cmd_status) != RF_CMD_OK) {
        PRINTF("cc26xx_rf_ble_beacon_process: status=0x%08lx\n", cmd_status);
        /* Continue... */
      }

      if(was_on) {
        /* We were on, go back to IEEE mode */
        if(rf_radio_setup(RF_MODE_IEEE) != RF_CMD_OK) {
          PRINTF("cc26xx_rf_ble_beacon_process: radio_setup() failed\n");
        }

        /* Enter IEEE RX mode */
        if(rx_on() != RF_CMD_OK) {
          PRINTF("cc26xx_rf_ble_beacon_process: rx_on() failed\n");
        }
      } else {
        power_down();

        /* Switch HF clock source to the RCOSC to preserve power */
        oscillators_switch_to_hf_rc();
      }
      etimer_set(&ble_adv_et, BLE_ADV_DUTY_CYCLE);

      interrupts_disabled = ti_lib_int_master_disable();

      ble_mode_on = 0;

      if(!interrupts_disabled) {
        ti_lib_int_master_enable();
      }

      /* Wait unless this is the last burst */
      if(i < BLE_ADV_MESSAGES - 1) {
        PROCESS_WAIT_EVENT();
      }
    }

    interrupts_disabled = ti_lib_int_master_disable();

    ble_mode_on = 0;

    if(!interrupts_disabled) {
      ti_lib_int_master_enable();
    }
  }
  PROCESS_END();
}
/*---------------------------------------------------------------------------*/
#endif /* CC26XX_RF_BLE_SUPPORT */
/*---------------------------------------------------------------------------*/
void
cc26xx_rf_ble_beacond_config(clock_time_t interval, const char *name)
{
#if CC26XX_RF_BLE_SUPPORT
  if(name != NULL) {
    memset(beacond_config.adv_name, 0, BLE_ADV_NAME_BUF_LEN);

    if(strlen(name) == 0 || strlen(name) >= BLE_ADV_NAME_BUF_LEN) {
      return;
    }

    memcpy(beacond_config.adv_name, name, strlen(name));
  }

  if(interval != 0) {
    beacond_config.interval = interval;
  }
#endif
}
/*---------------------------------------------------------------------------*/
uint8_t
cc26xx_rf_ble_beacond_start()
{
#if CC26XX_RF_BLE_SUPPORT
  if(beacond_config.adv_name[0] == 0) {
    return RF_CMD_ERROR;
  }

  process_start(&cc26xx_rf_ble_beacon_process, NULL);

  return RF_CMD_OK;
#else
  return RF_CMD_ERROR;
#endif
}
/*---------------------------------------------------------------------------*/
void
cc26xx_rf_ble_beacond_stop()
{
#if CC26XX_RF_BLE_SUPPORT
  process_exit(&cc26xx_rf_ble_beacon_process);
#endif
}
/*---------------------------------------------------------------------------*/
/** @} */
